app/controllers/articles_controller.rb

    def index
        two_days_ago = (Date.today - 2).iso8601

        response = RestClient.get(
        "http://newsapi.org/v2/everything?apiKey=33d9acb0b508450cb16344a38197e3e7&q=from=#{Date.today.iso8601}&to=#{two_days_ago}&language=en&pageSize=100")

        result = JSON.parse(response)

        valid_articles = result['articles'].select {|article| article['title'] && article['description'] }
---
SELECT "articles".* FROM "articles"